wisteria-1c/Конфигурация/DataProcessors/ДисконтныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ДисконтныеКарты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СвязиКонтрагентКонтакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентКонтакт</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязьНедействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ТипыКодовКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКодовКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штрихкод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МагнитныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Используется только для поиска ДК по номеру телефона, не может являться полноценным кодом карты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ВидыДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыДисконтныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкидкиВДисконтныхКартах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкидокВДисконтныхКартах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставСкидок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИменнаяКарта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовДляНакопительныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйМеханизмСкидок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГенерироватьНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрисваиватьНомерКартыКНомеруТелефона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонГенерацииШтрихкода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныГенерацииШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорогиНакопительныхСкидок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НижняяГраница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Comment>Может стоит сделать скидку процентом</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ДисконтныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДисконтныеКарты</Name>
			<Comment>Магнитные, штриховые и смешанные дисконтные карты</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыДисконтныхКарт</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКартыШтрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКартыМагнитный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаНедействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/DataProcessors/ДисконтныеКарты/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ДанныеСчитывателя; // Кэш данных считывателя магнитной карты

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнформацияУпрВалюта = Константы.ВалютаУчета.Получить();
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	
	Элементы.ВидыДисконтныхКарт.ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;
	
	// УНФ.ПанельКонтактнойИнформации
	КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформация", "СписокКонтекстноеМеню");
	ОтображатьБонусы = ПолучитьФункциональнуюОпцию("ИспользоватьБонусныеПрограммы");
	// Конец УНФ.ПанельКонтактнойИнформации
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		ТипыОборудования.СчитывательМагнитныхКарт = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	ИменаНетиповыхОтборов = "ОтборШтрихКод,ОтборМагнитныйКод,ОтборТолькоИменные";
	РаботаСОтборами.ОпределитьОтображениеПравойПанели(ЭтотОбъект);
	РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
	
	// МобильныйКлиент
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокКомментарий", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДеталиСпискаПроцентСкидкиИВладелец", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДеталиСпискаКонтрагент",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасшифровкаДокументы", "Видимость",
			Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвернутьОтборы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРазвернутьОтборы",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СписокКонтекстноеМенюПоказатьДополнительнуюИнформацию", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СписокПоказатьДополнительнуюИнформацию", "Видимость", Истина);
		
	КонецЕсли;
	// Конец МобильныйКлиент

	
	УстановитьУсловноеОформление();
		
	АдаптацияТакси();

КонецПроцедуры

// Процедура - обработчик события ПриОткрытии формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	Элементы.ГруппаИнформацияОБонусах.Видимость = ОтображатьБонусы;
КонецПроцедуры

// Процедура - обработчик события ПриЗакрытии формы.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование

	//УНФ.ОтборыСписка  
	Если НеНужноСохранятьНастройкиОтборов = Ложь Тогда	
		СохранитьНастройкиОтборов();
	КонецЕсли;
	//Конец УНФ.ОтборыСписка
КонецПроцедуры

// Процедура - обработчик события ОбработкаОповещения формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// УНФ.ПанельКонтактнойИнформации
	Если КонтактнаяИнформацияПанельУНФКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьПанельКонтактнойИнформацииСервер();
	КонецЕсли;
	// Конец УНФ.ПанельКонтактнойИнформации
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ДисконтныеКартыУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
			ТекущийЭлемент = Элементы.ОтборШтрихКод;
		ИначеЕсли ИмяСобытия ="TracksData" Тогда
			// Обработка ситуации, когда считыватель магнитных карт имитирует нажатие клавиши "Enter" после считывания магнитной карты.
			ТекДата = ОбщегоНазначенияКлиент.ДатаСеанса();
			
			ОбработатьДанныеСчитывателяМагнитныхКарт(Параметр);
			ТекущийЭлемент = Элементы.ОтборМагнитныйКод;
			
			// Обработка ситуации, когда считыватель магнитных карт имитирует нажатие клавиши "Enter" после считывания магнитной карты.
			// Символ перевода строки можно обрезать с помощью настроек подключаемого оборудования для считывателя магнитных карт.
			Пока (ОбщегоНазначенияКлиент.ДатаСеанса() - ТекДата) < 1 Цикл КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "ПослеЗаписи_ДисконтнаяКарта" Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Ссылка = Источник Тогда
			Комментарий = СтрЗаменить(Параметр, Символы.ПС, " ");
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ПослеЗаписи_ВидыДисконтныхКарт" Тогда
		ТекущиеДанные = Элементы.ВидыДисконтныхКарт.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Ссылка = Источник Тогда
			КомментарийВидыДисконтныхКарт = СтрЗаменить(Параметр, Символы.ПС, " ");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриЗагрузкеДанныхИзНастроекНаСервере формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборТолькоИменные = Настройки.Получить("ОтборТолькоИменные");
	// УНФ.ОтборыСписка
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	ВариантОтборовФормы = ВариантОтбораДляНастроек();
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, ДисконтныеКарты,,,, ВариантОтборовФормы, Ложь);
	// Конец УНФ.ОтборыСписка

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении элемента ОтборВидКарты.
//
&НаКлиенте
Процедура ОтборВидКартыПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("СписокДисконтныхКартОтборВидКарты");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДисконтныеКарты, "Владелец", ОтборВидКарты, , ,
		ЗначениеЗаполнено(ОтборВидКарты));
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ОтборТолькоИменные.
//
&НаКлиенте
Процедура ОтборТолькоИменныеПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("СписокДисконтныхКартОтборВидКарты");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
	Если ОтборТолькоИменные Тогда
		СброситьВсеМеткиОтбораНаСервере();
	Иначе
		СброситьВсеМеткиОтбораНаСервере();
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДисконтныеКарты, "ЭтоИменнаяКарта", ОтборТолькоИменные,
		ВидСравненияКомпоновкиДанных.Равно, , ОтборТолькоИменные);
	
	ОбновитьФильтрыПоДополнительнымФильтрам();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ОтборШтрихКод.
//
&НаКлиенте
Процедура ОтборШтрихКодПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("СписокДисконтныхКартОтборШтрихКод");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДисконтныеКарты, "КодКартыШтрихкод", ОтборШтрихКод,
		ВидСравненияКомпоновкиДанных.Содержит, , ЗначениеЗаполнено(ОтборШтрихКод));
	
	ОбновитьФильтрыПоДополнительнымФильтрам();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ОтборМагнитныйКод.
//
&НаКлиенте
Процедура ОтборМагнитныйКодПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("СписокДисконтныхКартОтборМагнитныйКод");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДисконтныеКарты, "КодКартыМагнитный",
		ОтборМагнитныйКод, ВидСравненияКомпоновкиДанных.Содержит, , ЗначениеЗаполнено(ОтборМагнитныйКод));
	
	ОбновитьФильтрыПоДополнительнымФильтрам();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокКонтактыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Контакты;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокДеталиНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Детали;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидКартыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Владелец", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусДействияКартыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьФильтрыПоДополнительнымФильтрам();

	УстановитьМеткуИОтборСписка("СтатусДействияКарты", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВладелецКартыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ВладелецКарты", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

	


// Процедура - обработчик события Нажатие элемента ГиперссылкаКакРаботатьСДисконтнымиКартамиВПрограмме формы.
//
&НаКлиенте
Процедура ГиперссылкаКакРаботатьСДисконтнымиКартамиВПрограммеНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура("Заголовок, КлючПодсказки", 
		"Как работать с дисконтными картами",
		"ДисконтныеКарты_КакРаботатьСДисконтнымиКартами");
	
	ОткрытьФорму("Обработка.МенеджерПодсказок.Форма", ПараметрыОткрытия,, УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура - обработчик события Нажатие элемента ГиперссылкаНаВидеоурокНажатие формы.
//
&НаКлиенте
Процедура ГиперссылкаНаВидеоурокНажатие(Элемент)
	
	АдресСтраницы = "https://rutube.ru/video/001127e83769dafb51081b663fc667a4/";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(АдресСтраницы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// Процедура - обработчик события ПриАктивизацииСтроки динамического списка Список.
//
&НаКлиенте
Процедура ДисконтныеКартыПриАктивизацииСтроки(Элемент)
	
	Если ТипЗнч(Элемент.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		
		Если Элемент.ТекущиеДанные = Неопределено Тогда
			Комментарий = "";
			//ИнформацияСсылка = ПредопределенноеЗначение("Справочник.ДисконтныеКарты.ПустаяСсылка");
		Иначе
			Комментарий = СтрЗаменить(Элемент.ТекущиеДанные.Комментарий, Символы.ПС, " ");
			//ИнформацияСсылка = Элемент.ТекущиеДанные.Ссылка;
		КонецЕсли;
		
		КонтрагентАктивнойСтроки = ?(Элемент.ТекущиеДанные = Неопределено, Неопределено, Элемент.ТекущиеДанные.ВладелецКарты);
		Если КонтрагентАктивнойСтроки <> ТекущийКонтрагент Тогда
		
			ТекущийКонтрагент = КонтрагентАктивнойСтроки;
		КонецЕсли;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиСписка", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыДисконтныхКарт

&НаКлиенте
Процедура ВидыДисконтныхКартПриАктивизацииСтроки(Элемент)
	
	Если ТипЗнч(Элемент.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		
		Если Элемент.ТекущиеДанные = Неопределено Тогда
			КомментарийВидыДисконтныхКарт = "";
		Иначе
			КомментарийВидыДисконтныхКарт = СтрЗаменить(Элемент.ТекущиеДанные.Комментарий, Символы.ПС, " ");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродажиПоДисконтнойКарте(Команда)
	
	Если Не ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "ПродажиПоДисконтнойКарте");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("СтПериод,ДисконтнаяКарта", Новый СтандартныйПериод, Элементы.Список.ТекущаяСтрока));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.ПродажиПоДисконтнымКартам.Форма", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	Если Не ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДисконтнаяКарта", Элементы.Список.ТекущаяСтрока);
	ПараметрыОткрытия.Вставить("ИнформацияКонтрагентТелефон", ИнформацияКонтрагентТелефон);
	ПараметрыОткрытия.Вставить("ИнформацияКонтрагентЭП", ИнформацияКонтрагентЭП);
	ПараметрыОткрытия.Вставить("ИнформацияПроцентСкидкиПоДисконтнойКарте", ИнформацияПроцентСкидкиПоДисконтнойКарте);
	ПараметрыОткрытия.Вставить("ИнформацияСуммаПродажПоДисконтнойКарте", ИнформацияСуммаПродажПоДисконтнойКарте);
	ПараметрыОткрытия.Вставить("ИнформацияУпрВалюта", ИнформацияУпрВалюта);
	ПараметрыОткрытия.Вставить("ИнформацияСуммаПродажПоДисконтнойКарте", ИнформацияСуммаПродажПоДисконтнойКарте);
	ПараметрыОткрытия.Вставить("ИнформацияОбОстаткеБонусныхБаллов", ИнформацияОбОстаткеБонусныхБаллов);
	ПараметрыОткрытия.Вставить("ЭлементыСписокТекущиеДанныеВладелецКарты", ТекущийКонтрагент);
	
	
	ОткрытьФорму("Обработка.ДисконтныеКарты.Форма.ДополнительнаяИнформация_МК", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиБонусныхБаллов(Команда)
	Если Не ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "Основной");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("БонуснаяКарта", Элементы.Список.ТекущаяСтрока));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.ОстаткиБонусныхБаллов.Форма", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяРеквизитаСписка = "ДисконтныеКарты";
	ИмяТЧДанныеМеток = "ДанныеМеток";
	ИмяТЧДанныеОтборов = "ДанныеОтборов";
	ИмяГруппыОтборов = "ГруппаОтборы";
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	ОтборШтрихКод = "";
	ОтборМагнитныйКод = "";
	ОтборТолькоИменные = Ложь;
	КоличествоДопФильтров = 0;
	СброситьВсеМеткиОтбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	СвернутьРазвернутьПанельОтборов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусКартыДействует(Команда)
	ИзменитьСтатусКарты(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусКартыНедействительна(Команда)
	ИзменитьСтатусКарты(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//#Область МеткиОтборов
//
//&НаСервере
//Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
//	
//	Если ПредставлениеЗначения="" Тогда
//		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
//	КонецЕсли; 
//	
//	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
//	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, ДисконтныеКарты, ИмяПоляОтбораСписка);
//	
//КонецПроцедуры
//
////@skip-warning
//&НаКлиенте
//Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
//	СтандартнаяОбработка)
//
//	СтандартнаяОбработка = Ложь;
//
//	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
//	УдалитьМеткуОтбора(МеткаИД);
//
//КонецПроцедуры
//
//&НаСервере
//Процедура УдалитьМеткуОтбора(МеткаИД)
//	
//	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, ДисконтныеКарты, МеткаИД);
//
//КонецПроцедуры
//
//&НаСервере
//Процедура ОбновитьЗаголовокПанелиПослеУстановкиОтбора()
//	
//	РеквизитыОтбора = "ОтборШтрихКод, ОтборМагнитныйКод";
//	РаботаСОтборами.УстановитьЗаголовокПравойПанелиМобильныйКлиент(ЭтотОбъект, "ПраваяПанель", "ДанныеМеток", РеквизитыОтбора);
//	
//КонецПроцедуры
//
//#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

// Процедура обрабатывает данные штрихкода, которые передаются из обработки оповещения формы.
//
&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	ОбработатьПолученныйКодНаКлиенте(МассивШтрихкодов[0].Штрихкод, ПредопределенноеЗначение("Перечисление.ТипыКодовКарт.Штрихкод"), Ложь);
	
КонецПроцедуры

// Процедура обрабатывает данные со считывателя магнитных карт, которые передаются из обработки оповещения формы.
//
&НаКлиенте
Процедура ОбработатьДанныеСчитывателяМагнитныхКарт(Данные)
	
	ДанныеСчитывателя = Данные;
	ОбработатьПолученныйКодНаКлиенте(ДанныеСчитывателя, ПредопределенноеЗначение("Перечисление.ТипыКодовКарт.МагнитныйКод"), Истина);
	
КонецПроцедуры

// Функция проверяет магнитный код на соответствие шаблону и возвращает список ДК, магнитный код или штрихкод.
//
&НаСервере
Функция ОбработатьПолученныйКодНаСервере(Данные, ТипКодаКарты, Предобработка, ЕстьНайденныеКарты = Ложь, ЕстьШаблон = Ложь)
	
	ЕстьНайденныеКарты = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипКода = ТипКодаКарты;
	Если ТипКода = Перечисления.ТипыКодовКарт.МагнитныйКод Тогда
		// При вызове функции параметр "Предобработка" будем устанавливать в значение Ложь, чтобы не использовались шаблоны
		// магнитных карт. В качестве кода карты будет использоваться строка, полученная конкатенацией строк со всех магнитных дорожек.
		// В большинстве дисконтных карт используется только одна дорожка, на которой записан только номер карты в формате ";КодКарты?".
		Если Предобработка Тогда
			ТекКодКарты = Данные[0]; // Данные 3х дорожек магнитной карты. На данный момент не используется. Можно использовать если карта не найдена.
			                        // В случае, когда карта не соответствует ни одному шаблону, то будет выдано предупреждение,
			                        // но кнопка "Готова" в форме нажата не будет.
			ДисконтныеКартыСтруктура = ДисконтныеКартыУНФВызовСервера.НайтиВидыДисконтныхКартПоДаннымСоСчитывателяМагнитныхКарт(Данные, ТипКода, Справочники.ВидыДисконтныхКарт.ПустаяСсылка());
			
			Возврат ДисконтныеКартыСтруктура;
		Иначе
			Если ТипЗнч(Данные) = Тип("Массив") Тогда
				ТекКодКарты = Данные[0];
			Иначе
				ТекКодКарты = Данные;
			КонецЕсли;
			ДисконтныеКартыУНФВызовСервера.ПодготовитьКодКартыПоНастройкамПоУмолчанию(ТекКодКарты);
			
			Возврат ТекКодКарты;
		КонецЕсли;
	Иначе
		Возврат Данные;
	КонецЕсли;
	
КонецФункции

// Функция проверяет магнитный код на соответствие шаблону и устанавливает магнитный код или штрихкод элемента справочника.
// Если ДК несколько, то пользователь выбирает нужный код из списка.
//
&НаКлиенте
Процедура ОбработатьПолученныйКодНаКлиенте(Данные, ПолученныйТипКода, Предобработка)
	
	Перем ЕстьНайденныеКарты, ЕстьШаблон;
	
	Результат = ОбработатьПолученныйКодНаСервере(Данные, ПолученныйТипКода, Предобработка, ЕстьНайденныеКарты, ЕстьШаблон);
	Если ПолученныйТипКода = ПредопределенноеЗначение("Перечисление.ТипыКодовКарт.МагнитныйКод") Тогда
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			ОтборМагнитныйКод = Результат;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДисконтныеКарты,
				"КодКартыМагнитный", ОтборМагнитныйКод, ВидСравненияКомпоновкиДанных.Содержит, ,
				ЗначениеЗаполнено(ОтборМагнитныйКод));
		Иначе
			Если Результат.Количество() = 1 Тогда
				ОтборМагнитныйКод = Результат.Получить(0).Значение;
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДисконтныеКарты,
					"КодКартыМагнитный", ОтборМагнитныйКод, ВидСравненияКомпоновкиДанных.Содержит, ,
					ЗначениеЗаполнено(ОтборМагнитныйКод));
			ИначеЕсли Результат.Количество() = 0 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(
					"ru = 'Код карты не соответствует ни одному из шаблонов магнитных карт.'"));
			Иначе
				Оповещение = Новый ОписаниеОповещения("ОбработатьПолученныйКодНаКлиентеЗавершение", ЭтаФорма);
				Результат.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выбор кода магнитной карты'"));
			КонецЕсли;
		КонецЕсли;
	Иначе
		ОтборШтрихКод = Результат;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДисконтныеКарты, "КодКартыШтрихкод",
			ОтборШтрихКод, ВидСравненияКомпоновкиДанных.Содержит, , ЗначениеЗаполнено(ОтборШтрихКод));
	КонецЕсли;

КонецПроцедуры

// Обработка выбора кода магнитной карты из списка, если найдено несколько дисконтных карт.
// 
// Параметры:
//  ВыбранныйЭлемент - Выбранный элемент
//  Параметры - Структура
&НаКлиенте
Процедура ОбработатьПолученныйКодНаКлиентеЗавершение(ВыбранныйЭлемент, Параметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ОтборМагнитныйКод = ВыбранныйЭлемент.Значение;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДисконтныеКарты, "КодКартыМагнитный",
			ОтборМагнитныйКод, ВидСравненияКомпоновкиДанных.Содержит, , ЗначениеЗаполнено(ОтборМагнитныйКод));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//#Область ПанельКонтактнойИнформации
//
//// УНФ.ПанельКонтактнойИнформации
//&НаСервере
//Процедура ОбновитьПанельКонтактнойИнформацииСервер()
//	
//	КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийКонтрагент);
//	
//	//Если ИнформацияПроцентСкидкиПоДисконтнойКарте = "<Автоскидки>" Тогда
//	//	Элементы.РасшифровкаПроцентСкидкиПоДисконтнойКарте.ЦветТекста = ЦветаСтиля.ЦветНедоступногоТекстаТабличнойЧасти;
//	//Иначе
//	//	Элементы.РасшифровкаПроцентСкидкиПоДисконтнойКарте.ЦветТекста = Новый Цвет;
//	//КонецЕсли;
//	
//КонецПроцедуры
//
////@skip-warning
//&НаКлиенте
//Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
//	
//КонецПроцедуры
//
////@skip-warning
//&НаКлиенте
//Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)
//	
//	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);
//	
//КонецПроцедуры
//
////@skip-warning
//&НаКлиенте
//Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду(Команда)
//	
//	КонтактнаяИнформацияПанельУНФКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийКонтрагент);
//	
//КонецПроцедуры
//
//// Конец УНФ.ПанельКонтактнойИнформации
//
//#КонецОбласти

#Область СтатусДействияКарты


&НаСервере
Процедура ИзменитьСтатусКарты(Недействительна)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Для Каждого СтрокаМассива Из ВыделенныеСтроки Цикл
		ДисконтнаяКартаОбъект = СтрокаМассива.ПолучитьОбъект();
		ОбщегоНазначения.УстановитьЗначениеРеквизита(ДисконтнаяКартаОбъект, "КартаНедействительна", Недействительна);
		
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("Справочник.ДисконтныеКарты");
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ДисконтнаяКартаОбъект.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		КонецПопытки;

	КонецЦикла;
	Элементы.Список.Обновить();
КонецПроцедуры
#КонецОбласти

//
// Обрабатывает событие активизации строки списка элементов справочника.
//
&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиСписка()
	
	ПараметрыИнфоПанели = Новый Структура;
	ПараметрыИнфоПанели.Вставить("РеквизитКИ", "ВладелецКарты");
	ПараметрыИнфоПанели.Вставить("ДисконтнаяКарта", Элементы.Список.ТекущаяСтрока);
	ПараметрыИнфоПанели.Вставить("ПроцентСкидкиПоДисконтнойКарте");
	ПараметрыИнфоПанели.Вставить("Контрагент");
	ПараметрыИнфоПанели.Вставить("КонтактноеЛицо");
	ДисконтныеКартыУНФКлиент.ДисконтныеКартыИнформационнаяПанельОбработатьАктивизациюСтрокиСписка(ЭтотОбъект,
		ПараметрыИнфоПанели);
	ОбновитьПанельКонтактнойИнформацииСервер();
	Если ИнформацияПроцентСкидкиПоДисконтнойКарте = НСтр("ru = '<АвтоСкидки>'") Тогда
		ИнформацияПроцентСкидкиПоДисконтнойКарте = "";
	КонецЕсли;
	
КонецПроцедуры // ОбработатьАктивизациюСтрокиСписка()

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ИнтерфейсТакси = Не Интерфейс85;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИндексФильтры", "Видимость", Интерфейс85);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИндексФильтрыТакси", "Видимость", ИнтерфейсТакси);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИзменитьФорму", "Видимость", ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокСправка", "Видимость", ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаИзменитьФорму", "Видимость", Интерфейс85);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправка", "Видимость", Интерфейс85);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения = "" Тогда
		ПредставлениеЗначения = Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, ДисконтныеКарты, ИмяПоляОтбораСписка,,Истина);
	Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	
	УстановитьОтборПоДействительнымСвязям();
	ОбновитьПанельСвязей();

	ОбновитьКоличествоФильтров();
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_")+1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, ДисконтныеКарты, МеткаИД);
	УстановитьОтборПоДействительнымСвязям();
	ОбновитьПанельСвязей();

КонецПроцедуры

&НаСервере
Функция ВариантОтбораДляНастроек()
	
	Если ОтборТолькоИменные Тогда
		// Отбор только покупателей
		ВариантОтборовФормы = "Именные";
	Иначе
		// //Отбор покупатель+поставщик, или без отбора
		ВариантОтборовФормы = "";
	КонецЕсли; 

	Возврат ВариантОтборовФормы;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	ВариантОтборовФормы = ВариантОтбораДляНастроек();
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект,,,ВариантОтборовФормы, Ложь);
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы,
		"ВключаяВложенные",
		Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя, "ДисконтныеКарты");
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере()
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, ДисконтныеКарты);
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоФильтров()
	
	КоличествоФильтров = 0;
	КоличествоФильтров = ДанныеМеток.Количество();
	КоличествоФильтров = КоличествоФильтров + КоличествоДопФильтров;
	КоличествоФильтровИндекс = КоличествоФильтров;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПанельСвязей()
	
	ТаблицаСвязей.Очистить();
	ОтборПоКонтакту = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(ДисконтныеКарты.Отбор,"Контакт");
	
	УстановленОтборПоОдномуКонтрагенту = ОтборПоКонтакту.Количество() <> 0 
		И ТипЗнч(ОтборПоКонтакту[0].ПравоеЗначение) = Тип("СписокЗначений") 
		И ОтборПоКонтакту[0].ПравоеЗначение.Количество() = 1
		И ОтборПоКонтакту[0].Использование;
		
	Если НЕ УстановленОтборПоОдномуКонтрагенту Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСвязиКонтакта", "Видимость", Ложь);
		Возврат;
	КонецЕсли;
	
	ТекущийКонтакт = ОтборПоКонтакту[0].ПравоеЗначение[0].Значение;
	Отбор = Новый Структура("Контакт",ТекущийКонтакт);
	Выборка = РегистрыСведений.СвязиКонтрагентКонтакт.Выбрать(,,Отбор,"Убыв");
	Пока Выборка.Следующий() Цикл
		Если Выборка.Контрагент <> ТекущийКонтрагент Тогда
			Продолжить;
		КонецЕсли;
		НоваяСвязь = ТаблицаСвязей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСвязь,Выборка);
		Если НЕ ЗначениеЗаполнено(НоваяСвязь.Должность) Тогда
			НоваяСвязь.Должность = НСтр("ru = '<Не указана>'");
		КонецЕсли;
		Если Выборка.СвязьНедействительна Тогда
			НоваяСвязь.Картинка = 1;
		Иначе
			НоваяСвязь.Картинка = 3;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСвязиКонтакта", "Видимость", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДействительнымСвязям()
	
	ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(ДисконтныеКарты.Отбор, "Контакт");
	ОтборНеУстановлен = (ЭлементыОтбора.Количество() = 0 ИЛИ (ТипЗнч(ЭлементыОтбора[0].ПравоеЗначение) = Тип("Массив") 
		И ЭлементыОтбора[0].ПравоеЗначение.Количество() = 0)
		ИЛИ (ТипЗнч(ЭлементыОтбора[0].ПравоеЗначение) = Тип("СписокЗначений") 
		И ЭлементыОтбора[0].ПравоеЗначение.Количество() = 0)
		ИЛИ ЭлементыОтбора[0].Использование = Ложь);
	
	Если ОтборНеУстановлен Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ДисконтныеКарты.Отбор, "ЕстьСвязи","");
		Возврат;
	КонецЕсли;
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить(Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДисконтныеКарты, "ЕстьСвязи", МассивОтбора,
			ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// 1. Недействительные карты выделяются серым
	НовоеУсловноеОформление = ДисконтныеКарты.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаПалитры.Серый;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СтатусДействияКарты");
	Отбор.ПравоеЗначение 	= "Недействительна";

//	// 2. Значение "Автоскидки" выделяется серым
//	//НовоеУсловноеОформление = ДисконтныеКарты.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
//	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
//	
//	ОформляемоеПоле = НовоеУсловноеОформление.Поля.Элементы.Добавить();
//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("РасшифровкаПроцентСкидкиПоДисконтнойКарте");
//	
//	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
//	Оформление.Значение 		= ЦветаПалитры.Серый;
//	Оформление.Использование 	= Истина;
//	
//	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
//	Отбор.Использование 	= Истина;
//	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ИнформацияПроцентСкидкиПоДисконтнойКарте");
//	Отбор.ПравоеЗначение 	= "<Автоскидки>";

КонецПроцедуры

#Область ПанельКонтактнойИнформации

&НаСервере
Процедура ОбновитьПанельКонтактнойИнформацииСервер()
	
	КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийКонтрагент);
	ОбновитьПанельСвязей();
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду(Команда)
	
	КонтактнаяИнформацияПанельУНФКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийКонтрагент);
	
КонецПроцедуры 

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФильтрыПоДополнительнымФильтрам()
	
	КоличествоДопФильтров = 0;
	
	Если ОтборТолькоИменные Тогда
		КоличествоДопФильтров = КоличествоДопФильтров + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборШтрихКод) Тогда
		КоличествоДопФильтров = КоличествоДопФильтров + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборМагнитныйКод) Тогда
		КоличествоДопФильтров = КоличествоДопФильтров + 1;
	КонецЕсли;
	
	РаботаСОтборамиКлиентСервер.ОбновитьКоличествоФильтров(ЭтотОбъект);
	РаботаСОтборамиКлиентСервер.УстановитьОтображениеКомандыСброситьВсеОтборы(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти
#КонецОбласти
